{
    "automation": [
        "Automate early, automate often. If you're still hand-crafting, you're living in the past.",
        "Belts, pipes, and power — the holy trinity of automation.",
        "Redundancy in automation saves tears later. Trust dad.",
        "Looping conveyor belts might look silly, but they’ll save your build from jamming up.",
        "The best automation is the kind you forget exists — until it breaks.",
        "Machines don’t sleep, and neither should your production line.",
        "Splitters are your friends. Treat them right and they’ll feed the whole base.",
        "Automating coal is like teaching your kid to make their own lunch. Pure freedom.",
        "A bottleneck isn’t a problem — it’s an opportunity to over-engineer.",
        "If it moves on its own, it’s magic. If it moves well, it’s automation.",
        "Backup generators are the unsung heroes of your chaotic genius.",
        "Overclocking is great — until it explodes. Build responsibly.",
        "Chain reactions are fun — when they're not accidental.",
        "If it works first try, double-check it anyway.",
        "Smart logistics are better than brute force conveyors.",
        "If your factory has traffic jams, it's time to add a roundabout. No shame.",
        "Let machines do the boring stuff so you can build stupid sky sculptures.",
        "Automate your crafting so you can manually mess around guilt-free.",
        "Logistics drones? Fancy. Still need charging. Plan ahead.",
        "Power grids are like toddlers — they'll crash if you ignore them too long.",
        "Auto-sorters save time... unless you enjoy rage-scrolling for screws.",
        "Build overflow systems — you'll thank past-you in the chaos.",
        "Put lights on automation failure points. Future-you will panic less.",
        "Just because it works doesn't mean it's optimal. But it's still cool.",
        "Loops can be elegant — or chaos. Yours can be both.",
        "Redundant wiring is just peace of mind in cable form.",
        "Sensors are snitches. Use them wisely.",
        "Add delays between systems or face glorious desync disasters.",
        "Test each automation segment like it's a puzzle, not a chore.",
        "Automate alerts — because panic is more effective when scheduled.",
        "Use logic gates. Flex your inner dad-engineer.",
        "Reserve one corner of the map for failed automation attempts.",
        "Track power usage with meters — or rely on gut. One of them works.",
        "Automated backups are boring until they save your factory.",
        "Don’t forget emergency shutdown buttons. For drama.",
        "Conveyor art is still automation. Embrace it.",
        "Modularize your systems. Each zone should have a purpose.",
        "An idle assembler is a cry for help.",
        "Refactor often — spaghetti code is fine, spaghetti conveyors are not.",
        "Group by input/output type. It’s nerdy and it works.",
        "Color-coded wires: the secret language of factory wizards.",
        "Befriend overflow chests. They're hoarders with a purpose.",
        "If it blinks, it should mean something.",
        "Clock circuits = the dad hacks of industrial timing.",
        "If a machine screams, listen. It's probably your fault.",
        "Leave signs for yourself. Machines remember nothing.",
        "Cluster machines with similar needs — reduce wire drama.",
        "Blueprints aren’t cheating — they’re time travel for factories.",
        "Add redundancy in power, belts, and your caffeine supply.",
        "The only bad automation is the one that stops working mid-session."
    ],
    "base_building": [
        "Plan for more space than you think you need. You’ll use it all. Trust me.",
        "Elevators and ramps make your base feel real — and usable.",
        "Build your base with flow in mind. You should be able to run through it without tripping on wires.",
        "Every dad-approved base has a viewing deck. Optional grill included.",
        "Use the terrain — don’t fight it. Natural elevation can be your blueprint.",
        "Start small, build smart. Bigger doesn't always mean better — but it's still fun.",
        "A ladder is just a vertical regret prevention system.",
        "Always build with escape routes. You *will* get chased eventually.",
        "Try building a 'command center' — somewhere to oversee your chaos like a true dad general.",
        "Multi-level bases keep your cables tidy and your brain happier.",
        "Base symmetry = brain symmetry. Coincidence? Probably not.",
        "A base without lighting is just a hazard waiting to happen.",
        "Use open spaces for flex — then forget what they were for.",
        "Floors matter. Stop building on dirt unless it’s part of the charm.",
        "Centralize your power core so you know where to panic first.",
        "A door you can’t reach during a siege is just decoration.",
        "Stairs are just slopes with commitment issues. Use wisely.",
        "Natural landmarks make great orientation points — and bragging rights.",
        "Put signs on everything. Even doors. Especially doors.",
        "Your base should survive you forgetting where you put stuff.",
        "Build higher than you think you need — it’s more fun that way.",
        "Use glass for floors. Remind yourself what's at stake.",
        "Hidden bunkers are cool. But can you *find* them later?",
        "Make pathways wide enough for panic sprints.",
        "One flat roof = future expansion guaranteed.",
        "Anchor your base in bedrock, not emotion.",
        "Roof tiles are fashion statements. Choose wisely.",
        "A central hub beats wandering silos.",
        "Add rest areas. Your character deserves lunch too.",
        "Outdoor space is just indoor space with weather.",
        "Stacking buildings is not lazy — it's efficient vertical ambition.",
        "A room with a purpose is a room that earns its lights.",
        "Try building with symmetry, then break it. Makes things interesting.",
        "Add a silly room. Every base needs one irrational chamber.",
        "Fountains? Decorative. Pointless. Completely necessary.",
        "Carve your initials into the floor somewhere. For legacy.",
        "Don't build everything where you spawn. Let the base grow.",
        "Walls prevent both monsters and wandering friends.",
        "Use color-coded zones. Even if just for drama.",
        "The build menu is your sketchpad. Be weird.",
        "Start with function. End with style.",
        "Add a roof early. It changes how you build everything.",
        "Give each floor a theme. Basement vibes are optional.",
        "Pillars add drama. Lean into it.",
        "The balcony exists so you can admire your work. Don’t skip it.",
        "Cluster utilities. Wandering pipes are a symptom.",
        "Your base is a story. Build like it.",
        "Sometimes, add a skylight. Because you’re worth it.",
        "Design for screenshots. The internet is watching.",
        "Leave a time capsule room. Fill it with nonsense."
    ],
    "storage": [
        "If you’re scrolling to find items, you need more boxes.",
        "Label everything. Future-you will high-five past-you.",
        "Overflow storage isn't lazy — it’s pro-level preparedness.",
        "Storage rooms should be organized like a dad’s garage — chaotic but knowable.",
        "Don't be afraid to go vertical with storage. Stack it like pancakes.",
        "When in doubt, double it. Then make it symmetrical.",
        "Storage isn’t just where you put stuff — it’s where dreams go until you need them.",
        "If your inventory’s full, your system’s not finished.",
        "A clean storage room is the sign of a messy adventure.",
        "Label one chest 'junk' and watch it become the most visited spot in your base.",
        "Color-code your storage if your memory is decorative only.",
        "Barrels, boxes, bins — whatever works, as long as you can find it.",
        "Auto-sorters aren't cheating. They're dad-tech.",
        "Centralize storage or accept eternal wandering.",
        "Use item frames or signs — mystery boxes are only fun once.",
        "One wall of storage is planning. Two is optimism. Three is realism.",
        "Make access paths wide — your inventory won't be the only thing overflowing.",
        "Stack smarter, not taller. Unless taller looks cooler.",
        "Don’t bury your emergency stash. Future-you might be panicking.",
        "If it takes more than 5 seconds to find an item, rethink your layout.",
        "Dedicated input bins are your new best friend.",
        "Seasonal hoards need seasonal cleanup. Sorry.",
        "The best kind of storage? The kind you forgot you built but still works.",
        "If you’re manually dumping everything, you’re in prehistory.",
        "Organization is temporary. Chaos is forever. Balance both.",
        "Sort by type, color, vibe — just be consistent.",
        "Storage near workstations saves sanity.",
        "Leave a buffer bin for overflow rage drops.",
        "If your chest meows, maybe don't open it. Or do.",
        "Signs with jokes increase inventory morale.",
        "Storage is life insurance for hoarders.",
        "Always leave space for ‘misc’. It’ll fill faster than anything else.",
        "A trash can is not defeat. It’s freedom.",
        "Avoid nesting containers. That way lies madness.",
        "Mark rare items with glow. They deserve the spotlight.",
        "Storage labels should be visible from orbit. Or at least across the room.",
        "Redundant storage is just safety in disguise.",
        "Add shelves even if the game doesn’t support it. Visual order matters.",
        "Build a ‘closet of shame’. Hide your regrets there.",
        "Leave the last chest empty. It gives hope.",
        "Craftable sorters are blessings. Worship them appropriately.",
        "Create themed vaults: ‘metals’, ‘magic’, ‘the good stuff’.",
        "Over-organizing can be fun. Or a trap. Proceed with joy.",
        "Public storage? Lock it. Friends are forgetful.",
        "Store weird items together. They like company.",
        "Don’t let clutter become a feature. Unless it’s funny.",
        "Rotate your stockpile. Old bread rules apply.",
        "If it’s shiny, store it twice. One for backup.",
        "A vault door isn’t necessary. But it feels amazing."
    ],
    "aesthetics": [
        "Symmetry brings peace. So do floor tiles that align properly.",
        "Light your base like you're showing it off on a real estate channel.",
        "Pathways and railings make it feel like home — and prevent falls.",
        "Functional *and* fabulous — your builds can be both.",
        "Glass floors: risky, stylish, and a little unhinged. Just like dad.",
        "Add windows. If you’re going to grind for hours, you might as well have a view.",
        "Accent lighting: because nothing says ‘power plant’ like mood lighting.",
        "Patterned floors are the dad flannel shirts of your factory. Timeless.",
        "A pretty base is a productive base. Science (probably).",
        "Use railings. Falling is funny until it’s you with 200 copper ingots.",
        "Color themes aren’t just for fun — they’re for screenshots.",
        "If your base looks good from above, you’re winning.",
        "Build statues. No reason. Just vibes.",
        "Decorative clutter makes your base feel lived-in. Or hoarded.",
        "Terraced farms aren’t just efficient. They’re Pinterest-worthy.",
        "Use waterfalls. Just do it. Be majestic.",
        "Matching walls and floors is peak visual discipline.",
        "Contrasts draw the eye. Chaos draws the soul.",
        "Use signs as art. Language is decoration too.",
        "Your base is a canvas. Paint it with resources.",
        "Themed rooms? That’s interior design. Go wild.",
        "Screenshots > stats. Show off the glam.",
        "If it makes you smile walking in, it's aesthetic.",
        "One random statue makes everything intentional.",
        "Line up lights. You'll feel 32% more professional.",
        "Don’t hide your pipes — highlight them with grace.",
        "Seasonal décor = instant cozy immersion.",
        "Caves can be classy. Add some lanterns.",
        "Layer textures: stone, wood, metal — variety is spice.",
        "Even a warehouse can have soul. Paint it.",
        "Embrace verticality. Tall rooms are fancy rooms.",
        "Colored lighting = mood control for engineers.",
        "Don’t underestimate floor decals. They anchor spaces.",
        "Mirrored builds show mastery — or madness.",
        "A great view is worth more than a fast exit.",
        "Garden areas are therapy. Build one.",
        "Fish tanks? Totally relevant to productivity.",
        "Theme your base like a museum. Call it art.",
        "Don’t build walls — build stories.",
        "Banners and flags: because sometimes you need flair.",
        "Put a couch down. Nobody will use it, but it looks nice.",
        "Let vines grow. Nature adds character.",
        "Frame a sunrise window. You’ll never regret it.",
        "Floating walkways make everything cooler.",
        "Repetition = rhythm. Use patterns boldly.",
        "Sculpt your landscape. Terraform like a proud dad.",
        "Paint machines if the game lets you. Express your soul.",
        "Add fountains. For no reason. Then call them 'functional'.",
        "If it sparkles, it belongs in your build."
    ],
    "motivation": [
        "A scuffed base is still a base. Keep building, champ.",
        "Rome wasn’t built in a day, and neither was your storage system.",
        "You got this, one conveyor belt at a time.",
        "Messy builds have character — and so do you.",
        "Even if it’s held together with duct tape and dreams, it works.",
        "When in doubt, take a break, grab a juice box, and come back stronger.",
        "Every failed build is a blueprint for your next success.",
        "Build like someone’s going to tour your base — even if it’s just your kid.",
        "If your base makes sense to you, that’s all that matters. Mostly.",
        "No one starts as a master builder. But every master builder started.",
        "Your chaos is someone else’s blueprint. Share it proudly.",
        "Your base might be messy — but it’s yours. And that’s beautiful.",
        "A bad day building is still better than a good day grinding with no base.",
        "Even dad didn’t build the grill station right the first time. You’re doing great.",
        "There’s no ‘wrong’ way to build. Just ‘your’ way.",
        "That weird little tower? It's a masterpiece. Own it.",
        "Every box placed is progress.",
        "You’re not behind. You’re building at your own pace.",
        "A crooked conveyor belt still carries iron.",
        "The build is never truly done. That’s the fun.",
        "If you're not failing, you're not experimenting enough.",
        "Some bases grow. Some evolve. Some explode. That’s life.",
        "Perfection is a myth. Finished is better.",
        "Your 2 AM build idea? Probably genius.",
        "Celebrate small wins — like finally organizing copper.",
        "Your vibe is valid. Keep building.",
        "It’s okay to rebuild. That’s how masterpieces are made.",
        "You can always fix it later. Or not. Both are fine.",
        "One tile at a time. That’s the way.",
        "Take breaks. Drink water. Admire your mess.",
        "Even chaos produces iron plates eventually.",
        "You don’t have to be fancy to be effective.",
        "The grind is real, but so is your style.",
        "Just showing up and building is a win.",
        "That crooked beam? Aesthetic. Call it intentional.",
        "Keep adding. Keep improving. Keep enjoying.",
        "You are the foreman of fun.",
        "Some builds whisper. Others shout. Yours sings.",
        "Trust your instincts. Even the weird ones.",
        "Progress is measured in weird contraptions.",
        "The best builders break things first.",
        "You make the rules. That includes ignoring them.",
        "Proud of you for opening the game today.",
        "Everything you build is part of your journey.",
        "Chaos is just creativity in motion.",
        "Don't wait for perfect — build anyway.",
        "You're crafting more than structures. You're crafting joy.",
        "The build doesn’t need to impress. It needs to express.",
        "If you laughed building it, it’s already perfect."
    ]
}